import 'package:flutter/material.dart';

class Article{

  Article({
    required this.title,
    required this.category,
    required this.details,
    required this.imageUrl,
    required this.backgroundColor,
  });

  String title;
  String category;
  String details;
  String imageUrl;
  Color backgroundColor;
  int nomberOfViews = 0;
  int nomberOfLikes = 0;
  int nomberOfShares = 0;
  
}

List<Article> fitness = [
  Article(
    title: 'كيف يؤثر التدخين على لياقتك البدنية وأدائك الرياضي؟',
    category: 'لياقة',
    details: '''
      نسمع كثيرًا عن الأمراض الخطيرة التي يسببها التدخين، مثل أمراض القلب والسرطان والسكتة الدماغية، لكنه لا يقتصر على ذلك، بل يؤثر أيضًا بشكل مباشر وسلبي على النشاط البدني والأداء الرياضي! [1]في هذا المقال، سنناقش كيف يؤثر التدخين في اللياقة البدنية، ولماذا يجعل ممارسة الرياضة أكثر صعوبة، وما الذي يحدث داخل الجسم نتيجة هذه العادة الضارة
      لماذا يقلل التدخين من قدرتك على ممارسة الرياضة؟
      عند التدخين، يحصل القلب والرئتان والعضلات على كمية أقل من الأكسجين، مما يقلل من مستوى اللياقة البدنية، ويجعل ممارسة الرياضة أكثر صعوبة، ويحدث ذلك بسبب المشاكل التالية التي يسببها التدخين: [1][3]
      انخفاض سعة الرئتين
      تلعب الرئتان دورًا أساسيًا في تحسين الأداء الرياضي، لكن التدخين يقلل من قدرتهما على العمل بكفاءة، فالقطران الناتج عن التدخين يغلّف الرئتين، مما يقلل من مرونة 
      أما على المدى الطويل، فقد يؤدي التدخين إلى الشعور بضيق التنفس حتى مع الأنشطة الخفيفة، ويؤثر سلبًا في أداء تمارين التحمل، مثل الجري، وركوب الدراجات، والسباحة.
      قلة الأكسجين
      التدخين يقلل كمية الأكسجين التي تصل إلى أعضاء الجسم، حيث يحتوي دخان السجائر على أول أكسيد الكربون، وهو غاز يرتبط بكريات الدم الحمراء بسهولة أكبر من الأكسجين، مما يقلل من قدرة الدم على نقل الأكسجين إلى باقي الجسم بنسبة تصل إلى 15%، وهذا النقص في الأكسجين يؤثر بشكل واضح في أداء التمارين التي تعتمد على التحمل، مثل تمارين الكارديو.
      بالإضافة إلى ذلك، فإن انخفاض الأكسجين في الجسم يضعف صحة العظام، ويزيد من خطر الكسور، كما يبطئ تعافي الأنسجة بنسبة تصل إلى 80%، مما يطيل مدة الشفاء من الإصابات.
      ضعف تدفق الدم
      النيكوتين وأول أكسيد الكربون الموجودان في الدخان يجعلان الدم أكثر لزوجة، مما يؤدي إلى تضيق الشرايين، وانخفاض تدفق الدم إلى القلب، والعضلات، والأعضاء الأخرى.
      خلال التمارين، يحتاج الجسم إلى تدفق دم سريع لتوصيل الأكسجين إلى العضلات، ولكن التدخين يعيق هذه العملية، مما يجعل الحركة أكثر صعوبة، ويقلل من كفاءة التمارين الرياضية.
      زيادة الجهد على القلب
      برفع التدخين ضغط الدم ومعدل ضربات القلب أثناء الراحة، ويجبره على العمل بجهد إضافي لتعويض نقص الأكسجين في الدم. وأثناء التمارين، يزداد هذا العبء بشكل أكبر، حيث يضطر القلب إلى الضخ بسرعة أعلى لتلبية احتياجات العضلات من الأكسجين، مما قد يؤدي إلى ارتفاع معدل ضربات القلب إلى مستويات خطيرة، ويُضعف الأداء الرياضي.
      ضعف جهاز المناعة
      يؤدي التدخين إلى إضعاف قدرة الجسم على محاربة الأمراض، فهو يدمر الأهداب الصغيرة في الشعب الهوائية، المسؤولة عن تنظيف الرئتين من الأوساخ والبكتيريا، مما يزيد من تراكم الشوائب، ويجعل المدخنين أكثر عرضة للإصابة بنزلات البرد والتهابات الجهاز التنفسي
      الإقلاع عن التدخين
      يمكن عكس العديد من الآثار السلبية للتدخين بمجرد الإقلاع عنه، مما يمنح الجسم فرصة لاستعادة صحته وقدرته على ممارسة النشاط البدني بكفاءة. لتحقيق ذلك، يمكن استشارة الطبيب حول استخدام ، أو أدوية مخصصة للإقلاع عن التدخين، أو اتباع استراتيجيات أخرى تساعد في التغلب على الإدمان. [4]
      تجدر الإشارة إلى أن ممارسة الرياضة بانتظام قد تسهّل عملية الإقلاع عن التدخين، إذ تقلل من الرغبة في التدخين، وتخفف أعراض الانسحاب، كما تسهم في تقليل التوتر وتعزيز الشعور بالراحة النفسية. وبمجرد الإقلاع، يبدأ معدل ضربات القلب في الانخفاض، ويتحسن تدفق الدم، وتزداد كفاءة الرئتين، مما ينعكس إيجابًا على الأداء الرياضي، ويجعل ممارسة التمارين أكثر سهولة. [3]
      نصيحة الطبي
      يُؤثر التدخين على لياقتك البدنية، فهو يجعلك تشعر بالتعب بسرعة، وضيق التنفس المتكرر، ويسبب اضطرابات النوم، ويزيد خطر تعرضك للإصابات الرياضية، وهذا قد يُقلل من استفادتك من التمارين الرياضية، لذا حاول الإقلاع عنه، خاصةً أنّه يجهد القلب والرئتين ويضعف جهاز المناعة.
  ''',
    imageUrl: 'assets/icons/png/placeholder.png',
    backgroundColor: Color(0xFFfccd0a),
  ),
];

List<Article> beauty = [
  Article(
    title: 'كيف يؤثر التدخين على لياقتك البدنية وأدائك الرياضي؟',
    category: 'جمال',
    details: '''
      نسمع كثيرًا عن الأمراض الخطيرة التي يسببها التدخين، مثل أمراض القلب والسرطان والسكتة الدماغية، لكنه لا يقتصر على ذلك، بل يؤثر أيضًا بشكل مباشر وسلبي على النشاط البدني والأداء الرياضي! [1]في هذا المقال، سنناقش كيف يؤثر التدخين في اللياقة البدنية، ولماذا يجعل ممارسة الرياضة أكثر صعوبة، وما الذي يحدث داخل الجسم نتيجة هذه العادة الضارة
      لماذا يقلل التدخين من قدرتك على ممارسة الرياضة؟
      عند التدخين، يحصل القلب والرئتان والعضلات على كمية أقل من الأكسجين، مما يقلل من مستوى اللياقة البدنية، ويجعل ممارسة الرياضة أكثر صعوبة، ويحدث ذلك بسبب المشاكل التالية التي يسببها التدخين: [1][3]
      انخفاض سعة الرئتين
      تلعب الرئتان دورًا أساسيًا في تحسين الأداء الرياضي، لكن التدخين يقلل من قدرتهما على العمل بكفاءة، فالقطران الناتج عن التدخين يغلّف الرئتين، مما يقلل من مرونة 
      أما على المدى الطويل، فقد يؤدي التدخين إلى الشعور بضيق التنفس حتى مع الأنشطة الخفيفة، ويؤثر سلبًا في أداء تمارين التحمل، مثل الجري، وركوب الدراجات، والسباحة.
      قلة الأكسجين
      التدخين يقلل كمية الأكسجين التي تصل إلى أعضاء الجسم، حيث يحتوي دخان السجائر على أول أكسيد الكربون، وهو غاز يرتبط بكريات الدم الحمراء بسهولة أكبر من الأكسجين، مما يقلل من قدرة الدم على نقل الأكسجين إلى باقي الجسم بنسبة تصل إلى 15%، وهذا النقص في الأكسجين يؤثر بشكل واضح في أداء التمارين التي تعتمد على التحمل، مثل تمارين الكارديو.
      بالإضافة إلى ذلك، فإن انخفاض الأكسجين في الجسم يضعف صحة العظام، ويزيد من خطر الكسور، كما يبطئ تعافي الأنسجة بنسبة تصل إلى 80%، مما يطيل مدة الشفاء من الإصابات.
      ضعف تدفق الدم
      النيكوتين وأول أكسيد الكربون الموجودان في الدخان يجعلان الدم أكثر لزوجة، مما يؤدي إلى تضيق الشرايين، وانخفاض تدفق الدم إلى القلب، والعضلات، والأعضاء الأخرى.
      خلال التمارين، يحتاج الجسم إلى تدفق دم سريع لتوصيل الأكسجين إلى العضلات، ولكن التدخين يعيق هذه العملية، مما يجعل الحركة أكثر صعوبة، ويقلل من كفاءة التمارين الرياضية.
      زيادة الجهد على القلب
      برفع التدخين ضغط الدم ومعدل ضربات القلب أثناء الراحة، ويجبره على العمل بجهد إضافي لتعويض نقص الأكسجين في الدم. وأثناء التمارين، يزداد هذا العبء بشكل أكبر، حيث يضطر القلب إلى الضخ بسرعة أعلى لتلبية احتياجات العضلات من الأكسجين، مما قد يؤدي إلى ارتفاع معدل ضربات القلب إلى مستويات خطيرة، ويُضعف الأداء الرياضي.
      ضعف جهاز المناعة
      يؤدي التدخين إلى إضعاف قدرة الجسم على محاربة الأمراض، فهو يدمر الأهداب الصغيرة في الشعب الهوائية، المسؤولة عن تنظيف الرئتين من الأوساخ والبكتيريا، مما يزيد من تراكم الشوائب، ويجعل المدخنين أكثر عرضة للإصابة بنزلات البرد والتهابات الجهاز التنفسي
      الإقلاع عن التدخين
      يمكن عكس العديد من الآثار السلبية للتدخين بمجرد الإقلاع عنه، مما يمنح الجسم فرصة لاستعادة صحته وقدرته على ممارسة النشاط البدني بكفاءة. لتحقيق ذلك، يمكن استشارة الطبيب حول استخدام ، أو أدوية مخصصة للإقلاع عن التدخين، أو اتباع استراتيجيات أخرى تساعد في التغلب على الإدمان. [4]
      تجدر الإشارة إلى أن ممارسة الرياضة بانتظام قد تسهّل عملية الإقلاع عن التدخين، إذ تقلل من الرغبة في التدخين، وتخفف أعراض الانسحاب، كما تسهم في تقليل التوتر وتعزيز الشعور بالراحة النفسية. وبمجرد الإقلاع، يبدأ معدل ضربات القلب في الانخفاض، ويتحسن تدفق الدم، وتزداد كفاءة الرئتين، مما ينعكس إيجابًا على الأداء الرياضي، ويجعل ممارسة التمارين أكثر سهولة. [3]
      نصيحة الطبي
      يُؤثر التدخين على لياقتك البدنية، فهو يجعلك تشعر بالتعب بسرعة، وضيق التنفس المتكرر، ويسبب اضطرابات النوم، ويزيد خطر تعرضك للإصابات الرياضية، وهذا قد يُقلل من استفادتك من التمارين الرياضية، لذا حاول الإقلاع عنه، خاصةً أنّه يجهد القلب والرئتين ويضعف جهاز المناعة.
  ''',
    imageUrl: 'https://images.unsplash.com/photo-1612817288484-6f916006741a?q=80&w=2070&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D',
    backgroundColor: Color(0xFFf05e8e),
  ),
];

List<Article> health = [
  Article(
    title: 'كيف يؤثر التدخين على لياقتك البدنية وأدائك الرياضي؟',
    category: 'صحة',
    details: '''
      نسمع كثيرًا عن الأمراض الخطيرة التي يسببها التدخين، مثل أمراض القلب والسرطان والسكتة الدماغية، لكنه لا يقتصر على ذلك، بل يؤثر أيضًا بشكل مباشر وسلبي على النشاط البدني والأداء الرياضي! [1]في هذا المقال، سنناقش كيف يؤثر التدخين في اللياقة البدنية، ولماذا يجعل ممارسة الرياضة أكثر صعوبة، وما الذي يحدث داخل الجسم نتيجة هذه العادة الضارة
      لماذا يقلل التدخين من قدرتك على ممارسة الرياضة؟
      عند التدخين، يحصل القلب والرئتان والعضلات على كمية أقل من الأكسجين، مما يقلل من مستوى اللياقة البدنية، ويجعل ممارسة الرياضة أكثر صعوبة، ويحدث ذلك بسبب المشاكل التالية التي يسببها التدخين: [1][3]
      انخفاض سعة الرئتين
      تلعب الرئتان دورًا أساسيًا في تحسين الأداء الرياضي، لكن التدخين يقلل من قدرتهما على العمل بكفاءة، فالقطران الناتج عن التدخين يغلّف الرئتين، مما يقلل من مرونة 
      أما على المدى الطويل، فقد يؤدي التدخين إلى الشعور بضيق التنفس حتى مع الأنشطة الخفيفة، ويؤثر سلبًا في أداء تمارين التحمل، مثل الجري، وركوب الدراجات، والسباحة.
      قلة الأكسجين
      التدخين يقلل كمية الأكسجين التي تصل إلى أعضاء الجسم، حيث يحتوي دخان السجائر على أول أكسيد الكربون، وهو غاز يرتبط بكريات الدم الحمراء بسهولة أكبر من الأكسجين، مما يقلل من قدرة الدم على نقل الأكسجين إلى باقي الجسم بنسبة تصل إلى 15%، وهذا النقص في الأكسجين يؤثر بشكل واضح في أداء التمارين التي تعتمد على التحمل، مثل تمارين الكارديو.
      بالإضافة إلى ذلك، فإن انخفاض الأكسجين في الجسم يضعف صحة العظام، ويزيد من خطر الكسور، كما يبطئ تعافي الأنسجة بنسبة تصل إلى 80%، مما يطيل مدة الشفاء من الإصابات.
      ضعف تدفق الدم
      النيكوتين وأول أكسيد الكربون الموجودان في الدخان يجعلان الدم أكثر لزوجة، مما يؤدي إلى تضيق الشرايين، وانخفاض تدفق الدم إلى القلب، والعضلات، والأعضاء الأخرى.
      خلال التمارين، يحتاج الجسم إلى تدفق دم سريع لتوصيل الأكسجين إلى العضلات، ولكن التدخين يعيق هذه العملية، مما يجعل الحركة أكثر صعوبة، ويقلل من كفاءة التمارين الرياضية.
      زيادة الجهد على القلب
      برفع التدخين ضغط الدم ومعدل ضربات القلب أثناء الراحة، ويجبره على العمل بجهد إضافي لتعويض نقص الأكسجين في الدم. وأثناء التمارين، يزداد هذا العبء بشكل أكبر، حيث يضطر القلب إلى الضخ بسرعة أعلى لتلبية احتياجات العضلات من الأكسجين، مما قد يؤدي إلى ارتفاع معدل ضربات القلب إلى مستويات خطيرة، ويُضعف الأداء الرياضي.
      ضعف جهاز المناعة
      يؤدي التدخين إلى إضعاف قدرة الجسم على محاربة الأمراض، فهو يدمر الأهداب الصغيرة في الشعب الهوائية، المسؤولة عن تنظيف الرئتين من الأوساخ والبكتيريا، مما يزيد من تراكم الشوائب، ويجعل المدخنين أكثر عرضة للإصابة بنزلات البرد والتهابات الجهاز التنفسي
      الإقلاع عن التدخين
      يمكن عكس العديد من الآثار السلبية للتدخين بمجرد الإقلاع عنه، مما يمنح الجسم فرصة لاستعادة صحته وقدرته على ممارسة النشاط البدني بكفاءة. لتحقيق ذلك، يمكن استشارة الطبيب حول استخدام ، أو أدوية مخصصة للإقلاع عن التدخين، أو اتباع استراتيجيات أخرى تساعد في التغلب على الإدمان. [4]
      تجدر الإشارة إلى أن ممارسة الرياضة بانتظام قد تسهّل عملية الإقلاع عن التدخين، إذ تقلل من الرغبة في التدخين، وتخفف أعراض الانسحاب، كما تسهم في تقليل التوتر وتعزيز الشعور بالراحة النفسية. وبمجرد الإقلاع، يبدأ معدل ضربات القلب في الانخفاض، ويتحسن تدفق الدم، وتزداد كفاءة الرئتين، مما ينعكس إيجابًا على الأداء الرياضي، ويجعل ممارسة التمارين أكثر سهولة. [3]
      نصيحة الطبي
      يُؤثر التدخين على لياقتك البدنية، فهو يجعلك تشعر بالتعب بسرعة، وضيق التنفس المتكرر، ويسبب اضطرابات النوم، ويزيد خطر تعرضك للإصابات الرياضية، وهذا قد يُقلل من استفادتك من التمارين الرياضية، لذا حاول الإقلاع عنه، خاصةً أنّه يجهد القلب والرئتين ويضعف جهاز المناعة.
  ''',
    imageUrl: 'https://images.unsplash.com/photo-1612817288484-6f916006741a?q=80&w=2070&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D',
    backgroundColor: Color(0xFF79bde8),
  ),
  Article(
    title: 'كيف يؤثر التدخين على لياقتك البدنية وأدائك الرياضي؟',
    category: 'صحة',
    details: '''
      نسمع كثيرًا عن الأمراض الخطيرة التي يسببها التدخين، مثل أمراض القلب والسرطان والسكتة الدماغية، لكنه لا يقتصر على ذلك، بل يؤثر أيضًا بشكل مباشر وسلبي على النشاط البدني والأداء الرياضي! [1]في هذا المقال، سنناقش كيف يؤثر التدخين في اللياقة البدنية، ولماذا يجعل ممارسة الرياضة أكثر صعوبة، وما الذي يحدث داخل الجسم نتيجة هذه العادة الضارة
      لماذا يقلل التدخين من قدرتك على ممارسة الرياضة؟
      عند التدخين، يحصل القلب والرئتان والعضلات على كمية أقل من الأكسجين، مما يقلل من مستوى اللياقة البدنية، ويجعل ممارسة الرياضة أكثر صعوبة، ويحدث ذلك بسبب المشاكل التالية التي يسببها التدخين: [1][3]
      انخفاض سعة الرئتين
      تلعب الرئتان دورًا أساسيًا في تحسين الأداء الرياضي، لكن التدخين يقلل من قدرتهما على العمل بكفاءة، فالقطران الناتج عن التدخين يغلّف الرئتين، مما يقلل من مرونة 
      أما على المدى الطويل، فقد يؤدي التدخين إلى الشعور بضيق التنفس حتى مع الأنشطة الخفيفة، ويؤثر سلبًا في أداء تمارين التحمل، مثل الجري، وركوب الدراجات، والسباحة.
      قلة الأكسجين
      التدخين يقلل كمية الأكسجين التي تصل إلى أعضاء الجسم، حيث يحتوي دخان السجائر على أول أكسيد الكربون، وهو غاز يرتبط بكريات الدم الحمراء بسهولة أكبر من الأكسجين، مما يقلل من قدرة الدم على نقل الأكسجين إلى باقي الجسم بنسبة تصل إلى 15%، وهذا النقص في الأكسجين يؤثر بشكل واضح في أداء التمارين التي تعتمد على التحمل، مثل تمارين الكارديو.
      بالإضافة إلى ذلك، فإن انخفاض الأكسجين في الجسم يضعف صحة العظام، ويزيد من خطر الكسور، كما يبطئ تعافي الأنسجة بنسبة تصل إلى 80%، مما يطيل مدة الشفاء من الإصابات.
      ضعف تدفق الدم
      النيكوتين وأول أكسيد الكربون الموجودان في الدخان يجعلان الدم أكثر لزوجة، مما يؤدي إلى تضيق الشرايين، وانخفاض تدفق الدم إلى القلب، والعضلات، والأعضاء الأخرى.
      خلال التمارين، يحتاج الجسم إلى تدفق دم سريع لتوصيل الأكسجين إلى العضلات، ولكن التدخين يعيق هذه العملية، مما يجعل الحركة أكثر صعوبة، ويقلل من كفاءة التمارين الرياضية.
      زيادة الجهد على القلب
      برفع التدخين ضغط الدم ومعدل ضربات القلب أثناء الراحة، ويجبره على العمل بجهد إضافي لتعويض نقص الأكسجين في الدم. وأثناء التمارين، يزداد هذا العبء بشكل أكبر، حيث يضطر القلب إلى الضخ بسرعة أعلى لتلبية احتياجات العضلات من الأكسجين، مما قد يؤدي إلى ارتفاع معدل ضربات القلب إلى مستويات خطيرة، ويُضعف الأداء الرياضي.
      ضعف جهاز المناعة
      يؤدي التدخين إلى إضعاف قدرة الجسم على محاربة الأمراض، فهو يدمر الأهداب الصغيرة في الشعب الهوائية، المسؤولة عن تنظيف الرئتين من الأوساخ والبكتيريا، مما يزيد من تراكم الشوائب، ويجعل المدخنين أكثر عرضة للإصابة بنزلات البرد والتهابات الجهاز التنفسي
      الإقلاع عن التدخين
      يمكن عكس العديد من الآثار السلبية للتدخين بمجرد الإقلاع عنه، مما يمنح الجسم فرصة لاستعادة صحته وقدرته على ممارسة النشاط البدني بكفاءة. لتحقيق ذلك، يمكن استشارة الطبيب حول استخدام ، أو أدوية مخصصة للإقلاع عن التدخين، أو اتباع استراتيجيات أخرى تساعد في التغلب على الإدمان. [4]
      تجدر الإشارة إلى أن ممارسة الرياضة بانتظام قد تسهّل عملية الإقلاع عن التدخين، إذ تقلل من الرغبة في التدخين، وتخفف أعراض الانسحاب، كما تسهم في تقليل التوتر وتعزيز الشعور بالراحة النفسية. وبمجرد الإقلاع، يبدأ معدل ضربات القلب في الانخفاض، ويتحسن تدفق الدم، وتزداد كفاءة الرئتين، مما ينعكس إيجابًا على الأداء الرياضي، ويجعل ممارسة التمارين أكثر سهولة. [3]
      نصيحة الطبي
      يُؤثر التدخين على لياقتك البدنية، فهو يجعلك تشعر بالتعب بسرعة، وضيق التنفس المتكرر، ويسبب اضطرابات النوم، ويزيد خطر تعرضك للإصابات الرياضية، وهذا قد يُقلل من استفادتك من التمارين الرياضية، لذا حاول الإقلاع عنه، خاصةً أنّه يجهد القلب والرئتين ويضعف جهاز المناعة.
  ''',
    imageUrl: 'https://images.unsplash.com/photo-1612817288484-6f916006741a?q=80&w=2070&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D',
    backgroundColor: Color(0xFF79bde8),
  ),
];

List<Article> food = [
  Article(
    title: 'كيف يؤثر التدخين على لياقتك البدنية وأدائك الرياضي؟',
    category: 'تغذية',
    details: '''
      نسمع كثيرًا عن الأمراض الخطيرة التي يسببها التدخين، مثل أمراض القلب والسرطان والسكتة الدماغية، لكنه لا يقتصر على ذلك، بل يؤثر أيضًا بشكل مباشر وسلبي على النشاط البدني والأداء الرياضي! [1]في هذا المقال، سنناقش كيف يؤثر التدخين في اللياقة البدنية، ولماذا يجعل ممارسة الرياضة أكثر صعوبة، وما الذي يحدث داخل الجسم نتيجة هذه العادة الضارة
      لماذا يقلل التدخين من قدرتك على ممارسة الرياضة؟
      عند التدخين، يحصل القلب والرئتان والعضلات على كمية أقل من الأكسجين، مما يقلل من مستوى اللياقة البدنية، ويجعل ممارسة الرياضة أكثر صعوبة، ويحدث ذلك بسبب المشاكل التالية التي يسببها التدخين: [1][3]
      انخفاض سعة الرئتين
      تلعب الرئتان دورًا أساسيًا في تحسين الأداء الرياضي، لكن التدخين يقلل من قدرتهما على العمل بكفاءة، فالقطران الناتج عن التدخين يغلّف الرئتين، مما يقلل من مرونة 
      أما على المدى الطويل، فقد يؤدي التدخين إلى الشعور بضيق التنفس حتى مع الأنشطة الخفيفة، ويؤثر سلبًا في أداء تمارين التحمل، مثل الجري، وركوب الدراجات، والسباحة.
      قلة الأكسجين
      التدخين يقلل كمية الأكسجين التي تصل إلى أعضاء الجسم، حيث يحتوي دخان السجائر على أول أكسيد الكربون، وهو غاز يرتبط بكريات الدم الحمراء بسهولة أكبر من الأكسجين، مما يقلل من قدرة الدم على نقل الأكسجين إلى باقي الجسم بنسبة تصل إلى 15%، وهذا النقص في الأكسجين يؤثر بشكل واضح في أداء التمارين التي تعتمد على التحمل، مثل تمارين الكارديو.
      بالإضافة إلى ذلك، فإن انخفاض الأكسجين في الجسم يضعف صحة العظام، ويزيد من خطر الكسور، كما يبطئ تعافي الأنسجة بنسبة تصل إلى 80%، مما يطيل مدة الشفاء من الإصابات.
      ضعف تدفق الدم
      النيكوتين وأول أكسيد الكربون الموجودان في الدخان يجعلان الدم أكثر لزوجة، مما يؤدي إلى تضيق الشرايين، وانخفاض تدفق الدم إلى القلب، والعضلات، والأعضاء الأخرى.
      خلال التمارين، يحتاج الجسم إلى تدفق دم سريع لتوصيل الأكسجين إلى العضلات، ولكن التدخين يعيق هذه العملية، مما يجعل الحركة أكثر صعوبة، ويقلل من كفاءة التمارين الرياضية.
      زيادة الجهد على القلب
      برفع التدخين ضغط الدم ومعدل ضربات القلب أثناء الراحة، ويجبره على العمل بجهد إضافي لتعويض نقص الأكسجين في الدم. وأثناء التمارين، يزداد هذا العبء بشكل أكبر، حيث يضطر القلب إلى الضخ بسرعة أعلى لتلبية احتياجات العضلات من الأكسجين، مما قد يؤدي إلى ارتفاع معدل ضربات القلب إلى مستويات خطيرة، ويُضعف الأداء الرياضي.
      ضعف جهاز المناعة
      يؤدي التدخين إلى إضعاف قدرة الجسم على محاربة الأمراض، فهو يدمر الأهداب الصغيرة في الشعب الهوائية، المسؤولة عن تنظيف الرئتين من الأوساخ والبكتيريا، مما يزيد من تراكم الشوائب، ويجعل المدخنين أكثر عرضة للإصابة بنزلات البرد والتهابات الجهاز التنفسي
      الإقلاع عن التدخين
      يمكن عكس العديد من الآثار السلبية للتدخين بمجرد الإقلاع عنه، مما يمنح الجسم فرصة لاستعادة صحته وقدرته على ممارسة النشاط البدني بكفاءة. لتحقيق ذلك، يمكن استشارة الطبيب حول استخدام ، أو أدوية مخصصة للإقلاع عن التدخين، أو اتباع استراتيجيات أخرى تساعد في التغلب على الإدمان. [4]
      تجدر الإشارة إلى أن ممارسة الرياضة بانتظام قد تسهّل عملية الإقلاع عن التدخين، إذ تقلل من الرغبة في التدخين، وتخفف أعراض الانسحاب، كما تسهم في تقليل التوتر وتعزيز الشعور بالراحة النفسية. وبمجرد الإقلاع، يبدأ معدل ضربات القلب في الانخفاض، ويتحسن تدفق الدم، وتزداد كفاءة الرئتين، مما ينعكس إيجابًا على الأداء الرياضي، ويجعل ممارسة التمارين أكثر سهولة. [3]
      نصيحة الطبي
      يُؤثر التدخين على لياقتك البدنية، فهو يجعلك تشعر بالتعب بسرعة، وضيق التنفس المتكرر، ويسبب اضطرابات النوم، ويزيد خطر تعرضك للإصابات الرياضية، وهذا قد يُقلل من استفادتك من التمارين الرياضية، لذا حاول الإقلاع عنه، خاصةً أنّه يجهد القلب والرئتين ويضعف جهاز المناعة.
  ''',
    imageUrl: 'https://images.unsplash.com/photo-1612817288484-6f916006741a?q=80&w=2070&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D',
    backgroundColor: Color(0xFfB4cf66),
  ),
  Article(
    title: 'كيف يؤثر التدخين على لياقتك البدنية وأدائك الرياضي؟',
    category: 'تغذية',
    details: '''
      نسمع كثيرًا عن الأمراض الخطيرة التي يسببها التدخين، مثل أمراض القلب والسرطان والسكتة الدماغية، لكنه لا يقتصر على ذلك، بل يؤثر أيضًا بشكل مباشر وسلبي على النشاط البدني والأداء الرياضي! [1]في هذا المقال، سنناقش كيف يؤثر التدخين في اللياقة البدنية، ولماذا يجعل ممارسة الرياضة أكثر صعوبة، وما الذي يحدث داخل الجسم نتيجة هذه العادة الضارة
      لماذا يقلل التدخين من قدرتك على ممارسة الرياضة؟
      عند التدخين، يحصل القلب والرئتان والعضلات على كمية أقل من الأكسجين، مما يقلل من مستوى اللياقة البدنية، ويجعل ممارسة الرياضة أكثر صعوبة، ويحدث ذلك بسبب المشاكل التالية التي يسببها التدخين: [1][3]
      انخفاض سعة الرئتين
      تلعب الرئتان دورًا أساسيًا في تحسين الأداء الرياضي، لكن التدخين يقلل من قدرتهما على العمل بكفاءة، فالقطران الناتج عن التدخين يغلّف الرئتين، مما يقلل من مرونة 
      أما على المدى الطويل، فقد يؤدي التدخين إلى الشعور بضيق التنفس حتى مع الأنشطة الخفيفة، ويؤثر سلبًا في أداء تمارين التحمل، مثل الجري، وركوب الدراجات، والسباحة.
      قلة الأكسجين
      التدخين يقلل كمية الأكسجين التي تصل إلى أعضاء الجسم، حيث يحتوي دخان السجائر على أول أكسيد الكربون، وهو غاز يرتبط بكريات الدم الحمراء بسهولة أكبر من الأكسجين، مما يقلل من قدرة الدم على نقل الأكسجين إلى باقي الجسم بنسبة تصل إلى 15%، وهذا النقص في الأكسجين يؤثر بشكل واضح في أداء التمارين التي تعتمد على التحمل، مثل تمارين الكارديو.
      بالإضافة إلى ذلك، فإن انخفاض الأكسجين في الجسم يضعف صحة العظام، ويزيد من خطر الكسور، كما يبطئ تعافي الأنسجة بنسبة تصل إلى 80%، مما يطيل مدة الشفاء من الإصابات.
      ضعف تدفق الدم
      النيكوتين وأول أكسيد الكربون الموجودان في الدخان يجعلان الدم أكثر لزوجة، مما يؤدي إلى تضيق الشرايين، وانخفاض تدفق الدم إلى القلب، والعضلات، والأعضاء الأخرى.
      خلال التمارين، يحتاج الجسم إلى تدفق دم سريع لتوصيل الأكسجين إلى العضلات، ولكن التدخين يعيق هذه العملية، مما يجعل الحركة أكثر صعوبة، ويقلل من كفاءة التمارين الرياضية.
      زيادة الجهد على القلب
      برفع التدخين ضغط الدم ومعدل ضربات القلب أثناء الراحة، ويجبره على العمل بجهد إضافي لتعويض نقص الأكسجين في الدم. وأثناء التمارين، يزداد هذا العبء بشكل أكبر، حيث يضطر القلب إلى الضخ بسرعة أعلى لتلبية احتياجات العضلات من الأكسجين، مما قد يؤدي إلى ارتفاع معدل ضربات القلب إلى مستويات خطيرة، ويُضعف الأداء الرياضي.
      ضعف جهاز المناعة
      يؤدي التدخين إلى إضعاف قدرة الجسم على محاربة الأمراض، فهو يدمر الأهداب الصغيرة في الشعب الهوائية، المسؤولة عن تنظيف الرئتين من الأوساخ والبكتيريا، مما يزيد من تراكم الشوائب، ويجعل المدخنين أكثر عرضة للإصابة بنزلات البرد والتهابات الجهاز التنفسي
      الإقلاع عن التدخين
      يمكن عكس العديد من الآثار السلبية للتدخين بمجرد الإقلاع عنه، مما يمنح الجسم فرصة لاستعادة صحته وقدرته على ممارسة النشاط البدني بكفاءة. لتحقيق ذلك، يمكن استشارة الطبيب حول استخدام ، أو أدوية مخصصة للإقلاع عن التدخين، أو اتباع استراتيجيات أخرى تساعد في التغلب على الإدمان. [4]
      تجدر الإشارة إلى أن ممارسة الرياضة بانتظام قد تسهّل عملية الإقلاع عن التدخين، إذ تقلل من الرغبة في التدخين، وتخفف أعراض الانسحاب، كما تسهم في تقليل التوتر وتعزيز الشعور بالراحة النفسية. وبمجرد الإقلاع، يبدأ معدل ضربات القلب في الانخفاض، ويتحسن تدفق الدم، وتزداد كفاءة الرئتين، مما ينعكس إيجابًا على الأداء الرياضي، ويجعل ممارسة التمارين أكثر سهولة. [3]
      نصيحة الطبي
      يُؤثر التدخين على لياقتك البدنية، فهو يجعلك تشعر بالتعب بسرعة، وضيق التنفس المتكرر، ويسبب اضطرابات النوم، ويزيد خطر تعرضك للإصابات الرياضية، وهذا قد يُقلل من استفادتك من التمارين الرياضية، لذا حاول الإقلاع عنه، خاصةً أنّه يجهد القلب والرئتين ويضعف جهاز المناعة.
  ''',
    imageUrl: 'https://images.unsplash.com/photo-1612817288484-6f916006741a?q=80&w=2070&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D',
    backgroundColor: Color(0xFfB4cf66),
  ),
  Article(
    title: 'كيف يؤثر التدخين على لياقتك البدنية وأدائك الرياضي؟',
    category: 'تغذية',
    details: '''
      نسمع كثيرًا عن الأمراض الخطيرة التي يسببها التدخين، مثل أمراض القلب والسرطان والسكتة الدماغية، لكنه لا يقتصر على ذلك، بل يؤثر أيضًا بشكل مباشر وسلبي على النشاط البدني والأداء الرياضي! [1]في هذا المقال، سنناقش كيف يؤثر التدخين في اللياقة البدنية، ولماذا يجعل ممارسة الرياضة أكثر صعوبة، وما الذي يحدث داخل الجسم نتيجة هذه العادة الضارة
      لماذا يقلل التدخين من قدرتك على ممارسة الرياضة؟
      عند التدخين، يحصل القلب والرئتان والعضلات على كمية أقل من الأكسجين، مما يقلل من مستوى اللياقة البدنية، ويجعل ممارسة الرياضة أكثر صعوبة، ويحدث ذلك بسبب المشاكل التالية التي يسببها التدخين: [1][3]
      انخفاض سعة الرئتين
      تلعب الرئتان دورًا أساسيًا في تحسين الأداء الرياضي، لكن التدخين يقلل من قدرتهما على العمل بكفاءة، فالقطران الناتج عن التدخين يغلّف الرئتين، مما يقلل من مرونة 
      أما على المدى الطويل، فقد يؤدي التدخين إلى الشعور بضيق التنفس حتى مع الأنشطة الخفيفة، ويؤثر سلبًا في أداء تمارين التحمل، مثل الجري، وركوب الدراجات، والسباحة.
      قلة الأكسجين
      التدخين يقلل كمية الأكسجين التي تصل إلى أعضاء الجسم، حيث يحتوي دخان السجائر على أول أكسيد الكربون، وهو غاز يرتبط بكريات الدم الحمراء بسهولة أكبر من الأكسجين، مما يقلل من قدرة الدم على نقل الأكسجين إلى باقي الجسم بنسبة تصل إلى 15%، وهذا النقص في الأكسجين يؤثر بشكل واضح في أداء التمارين التي تعتمد على التحمل، مثل تمارين الكارديو.
      بالإضافة إلى ذلك، فإن انخفاض الأكسجين في الجسم يضعف صحة العظام، ويزيد من خطر الكسور، كما يبطئ تعافي الأنسجة بنسبة تصل إلى 80%، مما يطيل مدة الشفاء من الإصابات.
      ضعف تدفق الدم
      النيكوتين وأول أكسيد الكربون الموجودان في الدخان يجعلان الدم أكثر لزوجة، مما يؤدي إلى تضيق الشرايين، وانخفاض تدفق الدم إلى القلب، والعضلات، والأعضاء الأخرى.
      خلال التمارين، يحتاج الجسم إلى تدفق دم سريع لتوصيل الأكسجين إلى العضلات، ولكن التدخين يعيق هذه العملية، مما يجعل الحركة أكثر صعوبة، ويقلل من كفاءة التمارين الرياضية.
      زيادة الجهد على القلب
      برفع التدخين ضغط الدم ومعدل ضربات القلب أثناء الراحة، ويجبره على العمل بجهد إضافي لتعويض نقص الأكسجين في الدم. وأثناء التمارين، يزداد هذا العبء بشكل أكبر، حيث يضطر القلب إلى الضخ بسرعة أعلى لتلبية احتياجات العضلات من الأكسجين، مما قد يؤدي إلى ارتفاع معدل ضربات القلب إلى مستويات خطيرة، ويُضعف الأداء الرياضي.
      ضعف جهاز المناعة
      يؤدي التدخين إلى إضعاف قدرة الجسم على محاربة الأمراض، فهو يدمر الأهداب الصغيرة في الشعب الهوائية، المسؤولة عن تنظيف الرئتين من الأوساخ والبكتيريا، مما يزيد من تراكم الشوائب، ويجعل المدخنين أكثر عرضة للإصابة بنزلات البرد والتهابات الجهاز التنفسي
      الإقلاع عن التدخين
      يمكن عكس العديد من الآثار السلبية للتدخين بمجرد الإقلاع عنه، مما يمنح الجسم فرصة لاستعادة صحته وقدرته على ممارسة النشاط البدني بكفاءة. لتحقيق ذلك، يمكن استشارة الطبيب حول استخدام ، أو أدوية مخصصة للإقلاع عن التدخين، أو اتباع استراتيجيات أخرى تساعد في التغلب على الإدمان. [4]
      تجدر الإشارة إلى أن ممارسة الرياضة بانتظام قد تسهّل عملية الإقلاع عن التدخين، إذ تقلل من الرغبة في التدخين، وتخفف أعراض الانسحاب، كما تسهم في تقليل التوتر وتعزيز الشعور بالراحة النفسية. وبمجرد الإقلاع، يبدأ معدل ضربات القلب في الانخفاض، ويتحسن تدفق الدم، وتزداد كفاءة الرئتين، مما ينعكس إيجابًا على الأداء الرياضي، ويجعل ممارسة التمارين أكثر سهولة. [3]
      نصيحة الطبي
      يُؤثر التدخين على لياقتك البدنية، فهو يجعلك تشعر بالتعب بسرعة، وضيق التنفس المتكرر، ويسبب اضطرابات النوم، ويزيد خطر تعرضك للإصابات الرياضية، وهذا قد يُقلل من استفادتك من التمارين الرياضية، لذا حاول الإقلاع عنه، خاصةً أنّه يجهد القلب والرئتين ويضعف جهاز المناعة.
  ''',
    imageUrl: 'https://images.unsplash.com/photo-1612817288484-6f916006741a?q=80&w=2070&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D',
    backgroundColor: Color(0xFfB4cf66),
  ),
];

List<List<Article>> allSections = [
  food,
  health,
  beauty,
  fitness,
];